# ForgeTypeId Constructor (String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ForgeTypeId Constructor (String)
ForgeTypeId Class See Also
---
Constructs a ForgeTypeId holding the given schema identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public ForgeTypeId(
	string typeId
)
```

Visual Basic
---
```text
Public Sub New ( _
	typeId As String _
)
```

Visual C++
---
```text
public:
ForgeTypeId(
	String^ typeId
)
```

# ### Parameters
typeId
    Type: System..::..String
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ForgeTypeId Class
ForgeTypeId Overload
Autodesk.Revit.DB Namespace